{
    "name":"KeQing",
    "title":"Driving Thunder",
    "sex":"Female", 
    "birthday":"20 November", 
    "region":"Liyue",
    "rarity":"⭐⭐⭐⭐⭐", 
    "element":"Electro",
    "weapon":"Sword", 
    "howtoobtain":"Wishes", 
    "description":"The Yuheng of the Liyue Qixing. Has much to say about Rex Lapis' unilateral approach to policymaking in Liyue - but in truth, gods admire skeptics such as her quite a lot.",
    "thumbnailurl":"https://rerollcdn.com/GENSHIN/Characters/Keqing.png",
    "mihoyoimageurl":"https://uploadstatic-sea.mihoyo.com/contentweb/20200828/2020082817192486254.png",
    "introgif":"https://media.giphy.com/media/u0MATmISUcn3YWmGrH/giphy.gif",
    "normalattack":{
        "name":"Yunlai Sword",
        "description":"Performs up to five rapid strikes. When charged, unleashes two rapid strikes.",
        "gif":"https://media.giphy.com/media/mz9Z11AATXUnxFa6uQ/giphy.gif"
    },
    "elementalskill":{
        "name":"Stellar Restoration",
        "description":"Throws a Lightning Stiletto at opponents and deals Electro DMG in small AoE. When held, she can adjust where the stilettos are thrown. She can also suspend them in the air and jump to them using Stellar Restoration.",
        "gif":"https://media.giphy.com/media/eCkKDUUK1CoLD1WN9R/giphy.gif"
    },
    "elementalburst":{
        "name":"Starward Sword",
        "description":"Keqing unleashes the power of lightning, dealing Electro DMG in an AoE. The final attack deals massive AoE Electro DMG.",
        "gif":"https://media.giphy.com/media/eu46b3p6jEFT9B6YRA/giphy.gif"
    },
    "passivetalent1":{
        "name":"Land's Overseer",
        "description":"When dispatched to Liyue, the time taken to complete the task decreases by 25%."
    },
    "passivetalent2":{
        "name":"Thundering Penance",
        "description":"If a Lightning Stiletto is present and Keqing recasts Stellar Restoration, her Normal and Charged Attacks are converted to Electro DMG."
    },
    "passivetalent3":{
        "name":"Aristocratic Dignity",
        "description":"When casting Starward Sword, Keqing's CRIT Rate and Energy Recharge increases by 15% for 8s."
    },
    "constellations":{
        "c1":"Thundering Might",
        "d1":"Recasting Stellar Restoration while a Lightning Stiletto is present causes Keqing to deal 50% of her ATK as AoE Electro DMG at the start point and terminus of her Blink.",
        "c2":"Keen Extraction",
        "d2":"When Keqing's Normal and Charged Attack's hit enemies affected by Electro, they have a 50% chance of producing an Elemental Particle. This effect can only occur once every 5s.",
        "c3":"Forseen Reformation",
        "d3":"Increases the Level of Starward Sword by 3.\nMaximum upgrade level is 15.",
        "c4":"Attunement",
        "d4":"For 10s after Keqing triggers an Electro-related Elemental Reaction, her ATK is increased by 25%.",
        "c5":"Beckoning Stars",
        "d5":"Increase the Level of Stellar Restoration by 3.\nMaximum upgrade level is 15.",
        "c6":"Tenacious Star",
        "d6":"When initiating a Normal Attack, Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% Electro DMG Bonus for 8s. Effects triggered by Normal Attacks, Charged Attacks, Elemental Skills and Elemental Bursts are considered independent entities."
    },
    "voiceactor":{
        "chinese":"Ying Xie (谢莹)",
        "japanese":"Eri Kitamura (喜多村 英梨)",
        "korean":"Bohee Lee (이보희)"
    },
    "profile":{
        "description":"One of the Liyue Qixing, Keqing has an uncompromising belief in actions over words. If she sees something that needs doing, she'll do it herself. For example, she traveled around Liyue and carefully memorized each detail of the land so that she may one day be able to maximize the utility of every last inch of Liyue.Keqing deals with the day-to-day affairs of Liyue, whether great or small, while Rex Lapis only descends once a year.To many, the millennia of prosperity that Liyue has enjoyed serve to legitimize Rex Lapis' guidance of the city. But Keqing has her reservations about all this, viewing Liyue's present prosperity as akin to a magnificent sandcastle on the beach — humanity does not have the luxury of deciding when the tide will come in.Rex Lapis has watched over Liyue for a millennium. But what about the next millennium? What about the next ten, or the next hundred millennia? How long are we expecting this status quo to last?It is this unanswered question that drives Keqing to work relentlessly and remain diligent.From most people's perspective, there is no point in working oneself up like this. But Keqing cannot sit by idly and ignore this hidden danger.The people of Liyue have never considered navigating the future on their own terms. But someone must walk on the front line of the epoch and forge a new path with their own hands.From most people's perspective, there is no point in working oneself up like this. But Keqing cannot sit by idly and ignore this hidden danger.",
        "link":"https://forums.mihoyo.com/genshin/article/16356"
    },
    "ascensions":"https://ninguest.github.io/genshin-impact/characters/resource/keqing.png"
}