{
    "name":"Mona",
    "title":"Enigmatic Astrologer",
    "sex":"Female", 
    "birthday":"31 August", 
    "region":"Mondstadt",
    "rarity":"⭐⭐⭐⭐⭐", 
    "element":"Hydro",
    "weapon":"Catalyst", 
    "howtoobtain":"Wishes", 
    "description":"A mysterious young astrologer who proclaims herself to be \"Astrologist Mona Megistus,\" and who possesses abilities to match the title.",
    "thumbnailurl":"https://rerollcdn.com/GENSHIN/Characters/Mona.png",
    "mihoyoimageurl":"https://uploadstatic-sea.mihoyo.com/contentweb/20200828/2020082817270842074.png",
    "introgif":"https://media.giphy.com/media/z7Gu0HcoF2E6OuY8zD/giphy.gif",
    "normalattack":{
        "name":"Ripple of Fate",
        "description":"Performs up to five water splashes that deal Hydro DMG. When charged, deals AoE Hydro DMG after a short casting time.",
        "gif":"https://media.giphy.com/media/EgblqZiFJ7izwFeOOE/giphy.gif"
    },
    "elementalskill":{
        "name":"Reflection of Doom",
        "description":"Creates a watery Phantom that distracts enemies, deals Hydro DMG, and then explodes dealing AoE Hyrdo DMG.",
        "gif":"https://media.giphy.com/media/MpEnoNliT0hQoJarKA/giphy.gif"
    },
    "elementalburst":{
        "name":"Stellaris Phantasm",
        "description":"Creates Illusory Bubble, which traps enemies and deals Hydro DMG.",
        "gif":"https://media.giphy.com/media/2CllAXU2Yla1k8NPrJ/giphy.gif"
    },
    "passivetalent1":{
        "name":"Principium of Astrology",
        "description":"When Mona crafts Weapon Ascension Materials there's a 20% chance a portion of the crafting materials will be refunded."
    },
    "passivetalent2":{
        "name":"Come 'n' Gem Me, Hag!",
        "description":"After using Illusory Torrent for 2s, Mona will automatically create a Phantom that will last for 2s and create an explosion with DMG equal to 50% of Mirror Reflection of Doom."
    },
    "passivetalent3":{
        "name":"Waterbourne Destiny",
        "description":"Increases Mona's Hydro DMG Bonus by a degree equivalent to 20% of her Energy Recharge rate."
    },
    "constellations":{
        "d1":"The effects of Hydro-related Elemental Reactions are enhanced for 8s after a character hits an enemy affected by an Omen: \n1) Electro-Charged DMG is increased by 15%.\n2) Vaporize DMG is increased by 15%.\n3) Hydro Swirl DMG is increased by 15%.\n 4) The duration for which enemies are Frozen is increased by 15%.",
        "c1":"Prophecy of Submersion",
        "c2":"Lunar Chain",
        "d2":"When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack. \n This effect can only occur once every 5s.",
        "c3":"Restless Revolution",
        "d3":"Increases the Level of Stellaris Phantasm by 3.\n Maximum upgrade level is 15.",
        "c4":"Prophecy of Oblivion",
        "d4":"When a character attacks an enemy affected by the Omen status effect, their CRIT Rate is increased by 15%.",
        "c5":"Mockery of Fortuna",
        "d5":"Increase the Level of Mirror Reflection of Doom by 3.\n Maximum upgrade level is 15.",
        "c6":"Rhetorics of Calamitas",
        "d6":"Upon entering Illusory Torrent, Mona gain a 60% increase to the DMG her next Charged Attack per second of movement. \n A maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s."
    },
    "voiceactor":{
        "chinese":"Tingting Chen (陈婷婷)",
        "japanese":"Konomi Kohara (小原 好美)",
        "korean":"Woo Jeong-shin (우정신)"
    },
    "profile":{
        "description":"Mona is unique among astrologers — others may speak with great ostentation for money, but Mona has never done so. Nor does she dress up or mince her words, even if her results are unpleasant to hear: \"You won't amount to anything even if you join the Adventurers' Guild.\" \"You've got no chance with him. In fact, he will soon leave you\" — such is the nature of her rejoinders.\n Her blunt nature has resulted in plummeting numbers of people coming to have their fortunes told. But Mona isn't one to complain, for that just leaves her with more time for her personal research.\nBut when one speaks of research, one also speaks of the necessity of purchasing texts and research apparatus. Mona's only income comes from her contributions to The Steambird's \"All Things Astrological\" column. Every paycheck is spent first on her research. Books from Liyue, an astrolabe from Sumeru... all of these come with a hefty price tag, and by the time Mona regains her senses, there's only enough of her income left for her to scrape by each month.\n”It matters not. Astrologers must rid themselves of material desires. Only by ridding oneself of clutter can one see the true world around them.\" So says Mona, coughing loudly all the while to cover the sound of her growling stomach.\nToday, too, is another day Mona worries about Mora",
        "link":"https://forums.mihoyo.com/genshin/article/16276"
    },
    "ascensions":"https://ninguest.github.io/genshin-impact/characters/resource/mona.PNG",

    "zhname":"莫娜",
    "zhdescription": "神秘的少女占星术士，声称自己是「伟大的占星术士莫娜」，拥有与名号相符的不俗实力，博学而高傲。 ",
    "zhsex":"女", 
    "zhbirthday":"8月31日 ",
    "zhtitle":"星天水镜 ", 
    "zhregion":"蒙德城",
    "zhelement":"水 ",
    "zhweapon":"法器", 
    "zhhowtoobtain":"祈愿",
    "zhimg":"https://media.giphy.com/media/z7Gu0HcoF2E6OuY8zD/giphy.gif" ,
    "zhnormalattack":{
        "name":"因果点破",
        "description":"普通攻击\n进行至多四段的水花攻击，造成水元素伤害。\n\n重击\n消耗一定体力，短暂咏唱后，造成水元素范围伤害。"
    },
    "zhelementalskill":{
        "name":"水中幻愿",
        "description":"聚集水花汇成命运的虚影。\n\n虚影\n具有如下特性：\n·持续嘲讽周围的敌人，吸引火力；\n·持续对附近的敌人造成水元素伤害；\n·持续时间结束时，虚影破裂，造成水元素范围伤害。\n\n长按\n借助水流之势迅速后退，并唤出虚影。\n\n场上同时只能存在一个通过水中幻愿创造的虚影。"
    },
    "zhelementalburst":{
        "name":"星命定轨  ",
        "description":"凝聚粼粼的水波，倒映出虚幻星空，对大范围内的敌人施加泡影状态。\n\n泡影\n以星相的气泡包裹敌人，施加潮湿状态。较弱的敌人会被禁锢在泡影中，无法行动。\n处于泡影影响下的敌人受到伤害时，会产生以下效果：\n·对敌人施加星异的伤害加成效果，并以此提高这一次造成的伤害；\n·解除泡影效果，并额外造成一次水元素伤害。此次水元素伤害不享受星异的伤害加成。\n\n星异\n持续时间内，提高目标对象受到的伤害。"
    },
    "zhpassivetalent1":{
        "name":"「老太婆来抓我啊!」",
        "description":"进入虚实流动状态2秒后，如果周围存在敌人，则自动凝聚一个虚影。通过这种方式产生的虚影持续2秒，造成的破裂伤害相当于水中幻愿伤害的50%。"
    },
    "zhpassivetalent2":{
        "name":"「托付于命运吧!」",
        "description":"莫娜的水元素伤害加成获得额外提升,提升程度相当于她的元素充能效率的20%。"
    },
    "zhpassivetalent3":{
        "name":"运行原理",
        "description":"合成武器突破素材时，有25%概率返还部分合成材料。"
    },
    "zhconstellations":{
        "c1":"沉没的预言   ",
        "d1":"角色的攻击命中处于星异状态下的敌人后的8秒内，水元素相关反应的效果提升：\n·感电反应造成的伤害提升15%，蒸发反应造成的伤害提升15%，水元素扩散反应造成的伤害提升15%；\n·冻结反应的持续时间延长15%。 ",
        "c2":"星月的连珠  ",
        "d2":"普通攻击命中时，有20%的几率自动施放一次重击。该效果每5秒只能触发一次。 ",
        "c3":"不休的天象  ",
        "d3":"星命定轨的技能等级提高3级。 ",
        "c4":"灭绝的预言   ",
        "d4":"角色攻击处于星异状态下的敌人时，暴击率提升15% ",
        "c5":"命运的嘲弄   ",
        "d5":"水中幻愿的技能等级提高3级。 ",
        "c6":"厄运的修辞  ",
        "d6":"进入虚实流动状态后，每移动1秒，莫娜的下—次重击伤害就增加60%，通过这种方式至多可以获得180%重击伤害加成，该效果至多持续8秒。 "
    },
    "zascensions":"https://ninguest.github.io/genshin-impact/characters/resource/zmona.PNG"
}