{
    "name":"Venti",
    "title":"The God of Freedom",
    "sex":"Male", 
    "birthday":"16 June", 
    "region":"Mondstadt",
    "rarity":"⭐⭐⭐⭐⭐", 
    "element":"Anemo",
    "weapon":"Bow", 
    "howtoobtain":"Wishes", 
    "description":"One of the many bards of Mondstadt, who freely wanders the city's streets and alleys.",
    "thumbnailurl":"https://rerollcdn.com/GENSHIN/Characters/Venti.png",
    "mihoyoimageurl":"https://uploadstatic-sea.mihoyo.com/contentweb/20191122/2019112210305833310.png",
    "introgif":"https://media.giphy.com/media/rS9TQ7AZYDzOC5KZ0r/giphy.gif",
    "normalattack":{
        "name":"Divine Marksmanship",
        "description":"Performs up to six consecutive shots with a bow. When charged, you can perform a precise Aimed Shot of Anemo DMG.",
        "gif":"https://media.giphy.com/media/eh2fPZhSE3P6GVlPqx/giphy.gif"
    },
    "elementalskill":{
        "name":"Skyward Sonnet",
        "description":"Summons a Wind Domain at your enemies and deals AoE Anemo DMG before launching enemies. When held, summons an even larger Wind Domain with Venti at the epicenter that deals AoE Anemo DMG and launches enemies.",
        "gif":"https://media.giphy.com/media/mnY6Bxf4xt9RKSF1OA/giphy.gif"
    },
    "elementalburst":{
        "name":"Wind's Grand Ode",
        "description":"Fires a wind arrow to make a massive Stormeye that pulls enemies in and does Anemo DMG.",
        "gif":"https://media.giphy.com/media/U0j4CbgZ1iuf7MlJGN/giphy.gif"
    },
    "passivetalent1":{
        "name":"Windrider",
        "description":"The party's gliding stamina consumption reduces by 20%."
    },
    "passivetalent2":{
        "name":"Embrace of Winds",
        "description":"Holding Skyward Sonnet creates an upcurrent that lasts for 20s."
    },
    "passivetalent3":{
        "name":"Stormeye",
        "description":"Regenerates 15 Energy for Venti after the effects of Wind's Grand Ode ends. If an Elemental Absorption occurs, then 15 Energy is restored to all characters of the same element type."
    },
    "constellations":{
        "c1":"Splitting Gale",
        "d1":"Fires 2 additional arrows per Aimed Shot, each dealing 33% of the original arrow's DMG.",
        "d2":"Skyward Sonnet decreases enemy Anemo RES by 12% for 10s.\nEnemies launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne.",
        "c2":"Breeze of Reminiscence",
        "c3":"Ode to Thousand Winds",
        "d3":"Increases the Level of Wind's Grand Ode by 3.\nMaximum upgrade level is 15.",
        "c4":"Hurricane of Freedom",
        "d4":"When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s.",
        "c5":"Concierto dal Cielo",
        "d5":"Increase the Level of Skyward Sonnet by 3.\nMaximum upgrade level is 15.",
        "c6":"Storm of Defiance",
        "d6":"Targets who take DMG from Wind's Grand Ode have their Anemo RES decreased by 20%.\nIf an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
    },
    "voiceactor":{
        "chinese":"Miaojiang (喵酱)",
        "japanese":"Ayumu Murase (村瀬 歩)",
        "korean":"Jung Yoo-jung (정유정)"
    },
    "profile":{
        "description":"Venti has a rather mischievous attitude and has a liking to rhyming in his speech, but if told to stop he will stop immediately. He sees a certain worth in music to the point where he names his lyre, saying \"every being deserves a name to be called upon, and woven into a song\". He is also quite bold, shown many times in both the manga and the game, not fearing to insult or ignore those who are supposedly powerful.Despite his naive personality as Venti, the Wind Archon himself might as well be a different side to him, in which Venti attests to saying \"That's that for the Anemo Archon's admonishments! Back to Venti time!\". When Venti assumes his personality as the Wind Archon, he speaks wisely and rather philosophically, guiding the Traveler, like he guided Mondstadt in its beginnings. ",
        "link":"https://genshin.mihoyo.com/en/character/mondstadt?char=7"
    },
    "ascensions":"https://ninguest.github.io/genshin-impact/characters/resource/venti.PNG",

    "zhname":"温迪",
    "zhdescription": "蒙德城诸多吟游诗人中的一位，自由自在地穿行在街头巷尾 ",
    "zhsex":"男 ", 
    "zhbirthday":"6月16日 ",
    "zhtitle":"高天的歌者", 
    "zhregion":"蒙德城",
    "zhelement":"风",
    "zhweapon":"弓", 
    "zhhowtoobtain":"祈愿",
    "zhimg":"https://media.giphy.com/media/rS9TQ7AZYDzOC5KZ0r/giphy.gif" ,
    "zhnormalattack":{
        "name":"神代射术  ",
        "description":"普通攻击\n进行至多六段的连续弓箭射击。\n\n重击\n进行伤害更高，更为精准的瞄准射击。\n瞄淮时，眷顾天地的风会在箭矢上持续积聚，聚满了风之力的箭矢会造成风元素伤害。"
    },
    "zhelementalskill":{
        "name":"高天之歌",
        "description":"呼唤与诗和乐协鸣的风，将在尘泥中行走的事物送上高空吧。\n\n点按\n在目标位置唤出风域，造成风元素范围伤害，并击飞其中的敌人。\n\n长按\n以自身为中心,唤出更大的风域，造成风元素范围伤害，并击飞其中的敌人。长按施放后，温迪会乘风飞到空中。"
    },
    "zhelementalburst":{
        "name":"风神之诗",
        "description":"射出千风汇聚而成的箭矢，在前方造出巨大的暴风之眼，将沿途的物体与敌人卷入，持续造成风元素伤害。\n\n元素转化\n若暴风之眼在技能持续期间接触了水元素/火元素/冰元素/雷元素，则会获得对应元素属性，额外造成该元素的附加伤害。\n元素转化在技能持续期间仅会发生一次。"
    },
    "zhpassivetalent1":{
        "name":"绪风之拥",
        "description":"长按高天之歌后，会产生上升气流，持续20秒。"
    },
    "zhpassivetalent2":{
        "name":"暴风之眼",
        "description":"风神之诗效果结束后，会为温迪恢复15点元素能量;若发生了元素转化，则同样为队伍中所有对应元素的角色恢复15点元素能量。"
    },
    "zhpassivetalent3":{
        "name":"恒风随行",
        "description":"队伍中所有角色滑翔消耗的体力降低20％。"
    },
    "zhconstellations":{
        "c1":"弦发的苍风   ",
        "d1":"瞄准射击会额外发射两枚分裂箭，分别造成原本33％的伤害。 ",
        "c2":"眷恋的泠风   ",
        "d2":"高天之歌会使敌人的风元素抗性与物理抗性降低12％，持续10秒。被高天之歌击飞的敌人在落地前，风元素抗性与物理抗性额外降低12％。 ",
        "c3":"千风的诗篇   ",
        "d3":"风神之诗的技能等级提高3级。（最高提升至15级） ",
        "c4":"自由的凛风   ",
        "d4":"温迪获取元素晶球或元素微粒后，获得25％的风元素伤害加成，持续10秒。 ",
        "c5":"高天的协奏   ",
        "d5":"高天之歌的技能等级提高3级。（最高提升至15级） ",
        "c6":"抗争的暴风  ",
        "d6":"受风神之诗伤害的敌人，风元素抗性降低20％。若产生了元素转化，则使转换的元素抗性也降低20％。 "
    },
    "zascensions":"https://ninguest.github.io/genshin-impact/characters/resource/zventi.PNG"
}